app/controllers/v1/streams_controller.rb

SELECT  "devices".* FROM "devices"  WHERE "devices"."id" = $1 LIMIT 1  [["id", 26]]
SELECT  "streams"."body", "streams"."created_at", "streams"."id" FROM "streams"  WHERE "streams"."device_id" = $1  ORDER BY created_at DESC LIMIT 1  [["device_id", 26]]
---
  def last
    id = params[:id]

    begin
      device = Device.find(id) if id
      streams = device.streams.select(:body,:created_at,:id).order("created_at DESC").limit(1)