app/controllers/v1/streams_controller.rb

SELECT  `devices`.* FROM `devices`  WHERE `devices`.`key` = 'xo1IADkm7xSP0TQWvEf0Fg' LIMIT 1
INSERT INTO "streams" ("body", "created_at", "device_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "{\"test\":10}"], ["created_at", "2014-10-18 23:20:56.028571"], ["device_id", 13], ["updated_at", "2014-10-18 23:20:56.028571"]]
---
  def new
    key = request.headers['key']
    device = Device.find_by_key(key) if key
    body = request.body.read

    if device && is_json_valid?(body)
      device.streams.create(body: body)

SELECT  `users`.* FROM `users`  WHERE `users`.`token` = 'fmtgEZsRApoV-BCX7fw5Zg' LIMIT 1
SELECT  "devices".* FROM "devices"  WHERE "devices"."id" = $1 LIMIT 1  [["id", 23]]
SELECT  "streams"."body", "streams"."created_at", "streams"."id" FROM "streams"  WHERE "streams"."device_id" = $1 AND (created_at >= '18-10-2014') AND (created_at < '2014-10-19')  ORDER BY created_at DESC LIMIT 100  [["device_id", 24]]
---
  def list
    user = User.find_by_token(params[:token])
    id = params[:id]
    if user.nil? || !user.devices.where(id: id)
      render status: :unauthorized
      return
    end



    if params[:date]
      date = params[:date]
      end_date = params[:end_date] == nil ? date : params[:end_date]
      end_date = Date.parse end_date
      end_date += 1.day
    end

    begin
      device = Device.find(id) if id
      streams = device.streams.select(:body,:created_at,:id).order("created_at DESC").limit(100)

SELECT  `devices`.* FROM `devices`  WHERE `devices`.`id` = 1 LIMIT 1
SELECT  `streams`.`body`, `streams`.`created_at`, `streams`.`id` FROM `streams`  WHERE `streams`.`device_id` = 1  ORDER BY created_at DESC LIMIT 1
---
  def getLast
    id = params[:id]

    begin
      device = Device.find(id) if id
      streams = device.streams.select(:body,:created_at,:id).order("created_at DESC").limit(1)