app/controllers/devices_controller.rb

  def destroy
    if @device.user.id == current_user.id
      @device.destroy
---
DELETE FROM "devices" WHERE "devices"."id" = $1  [["id", 7]]

    def set_device
      @device = Device.find(params[:id])
---
SELECT  "devices".* FROM "devices"  WHERE "devices"."id" = $1 LIMIT 1  [["id", 7]]