app/controllers/triggers_controller.rb

  def index
    @triggers = Trigger.all
---
SELECT "triggers".* FROM "triggers"

  def new
    @trigger = Trigger.new
    @devices = Device.all_from_user(current_user).map { |device| [device.name, device.id] }
---
SELECT "devices".* FROM "devices"  WHERE "devices"."user_id" IS NULL